'use strict';

/** @type {import('sequelize-cli').Migration} */
module.exports = {
  async up(queryInterface, Sequelize) {
    const gamesData = [
      {
        title: 'Гигамон',
        description:
          'Вы когда-нибудь слышали о гигамонах? Одноимённая игра на развитие памяти легко познакомит игроков от пяти лет с этими добрыми воплощениями стихий. Гигамоны помогают юным настольным магам сдать экзамен в волшебной школе и стать Заклинателями Элемонов. Правила призыва этих громадных, но безобидных и очаровательных чудищ просты и напоминают знакомую многим с детства мемори. Только вот обычным поиском парных картинок тут никто не отделается! Учитесь новому, будьте самыми внимательными и быстрыми стратегами, чтобы заработать звание лучшего волшебника и друга гигамонов.',
        image:
          'https://ae04.alicdn.com/kf/A15288d8885fb42fd8616dc355739f0ddP.png',
        player_count: 4,
      },
      {
        title: 'ЧПОК',
        description:
          'Что такое ЧПОК? Это смесь чёрного юмора, развратных слов, пошлых тем и похабных шуток, которые ваши друзья будут припоминать весь следующий год. Алкоголь не обязателен, но может усилить удовольствие. Главное — это отринуть стыд и смело составить из букв «Ж», «О», «П», «А» слово «ВЕЧНОСТЬ».',
        image:
          'https://lenta.servicecdn.ru/globalassets/1/-/59/70/80/378054_1.png?preset=fulllossywhite',
        player_count: 8,
      },
      {
        title: 'Взрывные Котята',
        description:
          'Эта быстрая карточная игра, Взрывные Котята, ворвалась на зарубежный рынок настольных игр в 2015 году, покорила Kickstarter, собрав больше 8 миллионов долларов, и получила номинацию лучшей игры для вечеринок. Простой и динамичный хит для маленькой компании с милыми котятами, крутыми иллюстрациями и простым игровым процессом.',
        image: 'https://www.igroved.ru/db/games/images/10/3010/01.jpg',
        player_count: 5,
      },
      {
        title: 'Королевский Бирпонг',
        description:
          '«У моей жены был день рождения, и она попросила меня организовать вечеринку. Решили, что главным развлечением будет Бирпонг. Но гостей было многовато — аж пятнадцать человек. И тогда родился Королевский Бирпонг! Идеальный для больших компаний. День рождения прошёл на ура, а уже через неделю мы сыграли в него в офисе и решили издавать! Почти год мы его дорабатывали. И вот настал день, когда моя домашняя разработка превратилась в игру, которая будет радовать не пятнадцать человек на одном празднике, а самые разные компании по всей стране.',
        image:
          'https://avatars.mds.yandex.net/get-mpic/5236119/img_id7478041843564592962.jpeg/orig',
        player_count: 20,
      },
      {
        title: 'Имаджинариум',
        description:
          'Имаджинариум — это настольная игра в ассоциации, отечественный аналог легендарного Диксита. Она оформлена российскими художниками и иллюстраторами и пользуется популярностью на отечественном рынке.',
        image:
          'https://main-cdn.sbermegamarket.ru/big1/hlr-system/154/106/301/114/102/100002140638b0.jpg',
        player_count: 7,
      },
      {
        title: 'Страдающее Средневековье',
        description:
          'Можно было бы назвать настольную игру Страдающее Средневековье градостроительной стратегией, если бы не взрывы хохота, разрушающие эту стройную теорию. Перед вами карточная игра с забавными и узнаваемым мемами из одноименного паблика, которая учит нас помнить историю и с легкостью переносить жизненные тяготы в любой век.',
        image:
          'https://hobbygames.ru/image/cache/hobbygames_beta/data/New_Making_Studio/Stradauschee_Srednevekovye/Stradayuchee_Srednevekove-1024x1024-wm.jpg',
        player_count: 6,
      },
      {
        title: 'Манчкин',
        description:
          '«Мочи Монстров! Хапай Сокровища! Подставляй Друзей!» – вот три веселых лозунга, под которыми проходит эта «милая» «душевная» игра-легенда, которая начиналась как пародия на популярнейшую ролевую игру Dungeons&Dragons и породила десятки новых карикатурных шедевров. Навреди ближнему своему, и оставим упрёки за пределами подземелья :)',
        image:
          'https://hobbygames.ru/image/data/HobbyWorld/Munchkin/Munchkin/Munchkin00.jpg',
        player_count: 6,
      },
      {
        title: 'Ётта',
        description:
          'Ваш мозг истосковался по остренькой интеллектуальной пище и уже обшаривает просторы интернета в поисках какого-нибудь лакомого кусочка? Обратите внимание на эту крошку, не пожалеете: ведь Ётта устроит термоядерный взрыв у вас в голове!',
        image:
          'https://www.igroved.ru/db/games/images/66/1366/igroved_iota_01.jpg',
        player_count: 4,
      },
      {
        title: 'Неудержимые Единорожки',
        description:
          'Ваша цель очень проста — собрать у себя наибольшее число единорогов. Вот только их можно красть, уничтожать, приносить в жертву... В общем, заскучать в процессе игры вы не рискуете. А если захочется добавить еще больше "взрослого" веселья, то можно обратиться к специальным блокам правил — на раздевание или с алкоголем.',
        image:
          'https://hobbygames.ru/image/cache/hobbygames_beta/data/HobbyWorld/Neuderzhimye_Edinorozhki18/Photos/Neuderzhimye_Edinorozhki18_00-1024x1024-wm.jpg',
        player_count: 8,
      },
      {
        title: 'Нечто',
        description:
          'Это вселяющая ужас и сомнения психологическая игра, где вам предстоит выяснить, в ком из ваших друзей прячется Нечто, пока оно не приобрело единомышленников и не заразило всю команду. Вперёд, господа подозрительные археологи: пора очистить помещение от этой дряни!',
        image:
          'https://hobbygames.ru/image/cache/hobbygames_beta/data/HobbyWorld/The_Thing/the_thing_00-1024x1024-wm.jpg',
        player_count: 12,
      },
      {
        title: 'Fluxx',
        description:
          'Fluxx — это настольная игра, в которой нет правил! Или это игра, в которой слишком много правил? Так сразу и не поймешь, ведь условия меняются каждую секунду, и никогда не знаешь, что принесет тебе следующий ход — моментальную победу или трагичное поражение?',
        image:
          'https://hobbygames.ru/image/cache/hobbygames_beta/data/HobbyWorld/Fluxx/Fluxx_3D_box_rozn00-1024x1024-wm.jpg',
        player_count: 3,
      },
    ];
    const games = gamesData.map((game) => ({
      ...game,
      createdAt: new Date(),
      updatedAt: new Date(),
    }));
    await queryInterface.bulkInsert('Games', games);
  },

  async down(queryInterface, Sequelize) {
    await queryInterface.bulkDelete('Games');
  },
};
